ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/MCAN_MSG_RAM_52600000h.xml
<module name="msg_ram" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSG_RAM_START" acronym="MSG_RAM_START" offset="0" width="32" description="START.">
		<bitfield id="START" width="32" begin="31" end="0" resetval="0x0" description="MCAN message mem Start address" range="31:0" rwaccess="R/W"/>
	</register><register id="MSG_RAM_END" acronym="MSG_RAM_END" offset="69628" width="32" description="END.">
		<bitfield id="END" width="32" begin="31" end="0" resetval="0x0" description="MCAN message mem End address" range="31:0" rwaccess="R/W"/>
	</register>
</module>